export const constellations = {
  "Лира": [
    "Геркулес",
    "Лебедь",
    "Лисичка",
    "Дракон"
  ],
  "Лебедь": [
    "Ящерица",
    "Цефей",
    "Лира",
    "Лисичка",
    "Дракон",
    "Пегас"
  ],
  "Лисичка": [
    "Геркулес",
    "Дельфин",
    "Стрела",
    "Лира",
    "Лебедь",
    "Пегас"
  ],
  "Стрела": [
    "Геркулес",
    "Дельфин",
    "Орёл",
    "Лисичка"
  ],
  "Орёл": [
    "Геркулес",
    "Дельфин",
    "Стрела",
    "Змея",
    "Водолей",
    "Змееносец",
    "Стрелец",
    "Козерог",
    "Щит"
  ],
  "Геркулес": [
    "Лира",
    "Лисичка",
    "Стрела",
    "Орёл",
    "Дракон",
    "Змееносец",
    "Змея",
    "Волопас",
    "Северная Корона"
  ],
  "Дельфин": [
    "Малый Конь",
    "Пегас",
    "Лисичка",
    "Стрела",
    "Орёл",
    "Водолей"
  ],
  "Дракон": [
    "Цефей",
    "Лира",
    "Лебедь",
    "Геркулес",
    "Волопас",
    "Большая Медведица",
    "Жираф",
    "Малая Медведица"
  ],
  "Водолей": [
    "Малый Конь",
    "Дельфин",
    "Орёл",
    "Пегас",
    "Рыбы",
    "Кит",
    "Скульптор",
    "Южная Рыба",
    "Козерог"
  ],
  "Змееносец": [
    "Змея",
    "Орёл",
    "Геркулес",
    "Стрелец",
    "Скорпион",
    "Весы"
  ],
  "Пегас": [
    "Малый Конь",
    "Ящерица",
    "Лебедь",
    "Лисичка",
    "Дельфин",
    "Водолей",
    "Андромеда",
    "Рыбы"
  ],
  "Малый Конь": [
    "Пегас",
    "Дельфин",
    "Водолей"
  ],
  "Ящерица": [
    "Лебедь",
    "Пегас",
    "Андромеда",
    "Кассиопея",
    "Цефей"
  ],
  "Цефей": [
    "Ящерица",
    "Лебедь",
    "Дракон",
    "Малая Медведица",
    "Жираф",
    "Кассиопея"
  ],
  "Северная Корона": [
    "Волопас",
    "Змея",
    "Геркулес"
  ],
  "Волопас": [
    "Дракон",
    "Большая Медведица",
    "Гончие Псы",
    "Волосы Вероники",
    "Дева",
    "Змея",
    "Северная Корона",
    "Геркулес"
  ],
  "Змея": [
    "Волопас",
    "Северная Корона",
    "Дева",
    "Весы",
    "Змееносец",
    "Геркулес",
    "Орёл",
    "Стрелец",
    "Щит"
  ],
  "Большая Медведица": [
    "Дракон",
    "Жираф",
    "Рысь",
    "Малый Лев",
    "Лев",
    "Волосы Вероники",
    "Гончие Псы",
    "Волопас"
  ],
  "Щит": [
    "Змея",
    "Орёл",
    "Стрелец"
  ],
  "Малая Медведица": [
    "Дракон",
    "Жираф",
    "Цефей"
  ],
  "Жираф": [
    "Кассиопея",
    "Цефей",
    "Малая Медведица",
    "Дракон",
    "Большая Медведица",
    "Рысь",
    "Возничий",
    "Персей"
  ],
  "Скорпион": [
    "Стрелец",
    "Змееносец",
    "Весы",
    "Волк",
    "Наугольник",
    "Жертвенник",
    "Южная Корона"
  ],
  "Стрелец": [
    "Индеец",
    "Микроскоп",
    "Козерог",
    "Орёл",
    "Щит",
    "Змея",
    "Змееносец",
    "Скорпион",
    "Южная Корона",
    "Телескоп"
  ],
  "Козерог": [
    "Водолей",
    "Орёл",
    "Стрелец",
    "Микроскоп",
    "Южная Рыба"
  ],
  "Весы": [
    "Скорпион",
    "Змееносец",
    "Дева",
    "Змея",
    "Гидра",
    "Центавр",
    "Волк"
  ],
  "Дева": [
    "Весы",
    "Змея",
    "Волопас",
    "Волосы Вероники",
    "Лев",
    "Чаша",
    "Ворон",
    "Гидра"
  ],
  "Лев": [
    "Дева",
    "Волосы Вероники",
    "Большая Медведица",
    "Малый Лев",
    "Рысь",
    "Рак",
    "Гидра",
    "Секстант",
    "Чаша"
  ],
  "Волосы Вероники": [
    "Волопас",
    "Гончие Псы",
    "Большая Медведица",
    "Лев",
    "Дева"
  ],
  "Гончие Псы": [
    "Волопас",
    "Большая Медведица",
    "Волосы Вероники"
  ],
  "Кассиопея": [
    "Жираф",
    "Цефей",
    "Ящерица",
    "Андромеда",
    "Персей"
  ],
  "Андромеда": [
    "Персей",
    "Кассиопея",
    "Ящерица",
    "Пегас",
    "Рыбы",
    "Треугольник"
  ],
  "Персей": [
    "Возничий",
    "Жираф",
    "Кассиопея",
    "Андромеда",
    "Треугольник",
    "Овен",
    "Телец"
  ],
  "Треугольник": [
    "Персей",
    "Андромеда",
    "Рыбы",
    "Овен"
  ],
  "Рыбы": [
    "Овен",
    "Треугольник",
    "Андромеда",
    "Пегас",
    "Водолей",
    "Кит"
  ],
  "Овен": [
    "Телец",
    "Персей",
    "Треугольник",
    "Рыбы",
    "Кит"
  ],
  "Возничий": [
    "Близнецы",
    "Рысь",
    "Жираф",
    "Персей",
    "Телец"
  ],
  "Телец": [
    "Орион",
    "Близнецы",
    "Возничий",
    "Персей",
    "Овен",
    "Кит",
    "Эридан"
  ],
  "Рак": [
    "Лев",
    "Малый Лев",
    "Рысь",
    "Близнецы",
    "Малый Пёс",
    "Гидра"
  ],
  "Близнецы": [
    "Рак",
    "Рысь",
    "Возничий",
    "Телец",
    "Орион",
    "Единорог",
    "Малый Пёс"
  ],
  "Орион": [
    "Единорог",
    "Близнецы",
    "Телец",
    "Эридан",
    "Заяц"
  ],
  "Единорог": [
    "Гидра",
    "Малый Пёс",
    "Близнецы",
    "Орион",
    "Заяц",
    "Большой Пёс",
    "Корма"
  ],
  "Малый Пёс": [
    "Гидра",
    "Рак",
    "Близнецы",
    "Единорог"
  ],
  "Кит": [
    "Эридан",
    "Телец",
    "Овен",
    "Рыбы",
    "Водолей",
    "Скульптор",
    "Печь"
  ],
  "Гидра": [
    "Весы",
    "Дева",
    "Ворон",
    "Чаша",
    "Секстант",
    "Лев",
    "Рак",
    "Малый Пёс",
    "Единорог",
    "Корма",
    "Компас",
    "Насос",
    "Центавр",
    "Волк"
  ],
  "Секстант": [
    "Чаша",
    "Лев",
    "Гидра"
  ],
  "Эридан": [
    "Заяц",
    "Орион",
    "Телец",
    "Кит",
    "Печь",
    "Феникс",
    "Тукан",
    "Южная Гидра",
    "Часы",
    "Резец"
  ],
  "Малый Лев": [
    "Лев",
    "Большая Медведица",
    "Рысь",
    "Рак"
  ],
  "Рысь": [
    "Малый Лев",
    "Большая Медведица",
    "Жираф",
    "Возничий",
    "Близнецы",
    "Рак",
    "Лев"
  ],
  "Чаша": [
    "Ворон",
    "Дева",
    "Лев",
    "Секстант",
    "Гидра"
  ],
  "Ворон": [
    "Дева",
    "Чаша",
    "Гидра"
  ],
  "Заяц": [
    "Большой Пёс",
    "Единорог",
    "Орион",
    "Эридан",
    "Резец",
    "Голубь"
  ],
  "Большой Пёс": [
    "Корма",
    "Единорог",
    "Заяц",
    "Голубь"
  ],
  "Корма": [
    "Компас",
    "Гидра",
    "Единорог",
    "Большой Пёс",
    "Голубь",
    "Живописец",
    "Киль",
    "Паруса"
  ],
  "Компас": [
    "Насос",
    "Гидра",
    "Корма",
    "Паруса"
  ],
  "Насос": [
    "Центавр",
    "Гидра",
    "Компас",
    "Паруса"
  ],
  "Центавр": [
    "Волк",
    "Весы",
    "Гидра",
    "Насос",
    "Паруса",
    "Киль",
    "Муха",
    "Южный Крест",
    "Циркуль"
  ],
  "Волк": [
    "Скорпион",
    "Весы",
    "Гидра",
    "Центавр",
    "Циркуль",
    "Наугольник"
  ],
  "Голубь": [
    "Корма",
    "Большой Пёс",
    "Заяц",
    "Резец",
    "Живописец"
  ],
  "Резец": [
    "Голубь",
    "Заяц",
    "Эридан",
    "Часы",
    "Золотая Рыба",
    "Живописец"
  ],
  "Сетка": [
    "Золотая Рыба",
    "Часы",
    "Южная Гидра"
  ],
  "Часы": [
    "Резец",
    "Эридан",
    "Южная Гидра",
    "Сетка",
    "Золотая Рыба"
  ],
  "Киль": [
    "Центавр",
    "Паруса",
    "Корма",
    "Живописец",
    "Летучая Рыба",
    "Хамелеон",
    "Муха"
  ],
  "Паруса": [
    "Центавр",
    "Насос",
    "Компас",
    "Корма",
    "Киль"
  ],
  "Живописец": [
    "Киль",
    "Корма",
    "Голубь",
    "Резец",
    "Золотая Рыба",
    "Летучая Рыба"
  ],
  "Летучая Рыба": [
    "Киль",
    "Живописец",
    "Золотая Рыба",
    "Столовая Гора",
    "Хамелеон"
  ],
  "Южный Крест": [
    "Центавр",
    "Муха"
  ],
  "Муха": [
    "Циркуль",
    "Центавр",
    "Южный Крест",
    "Киль",
    "Хамелеон",
    "Райская Птица"
  ],
  "Циркуль": [
    "Наугольник",
    "Волк",
    "Центавр",
    "Муха",
    "Райская Птица",
    "Южный Треугольник"
  ],
  "Золотая Рыба": [
    "Живописец",
    "Резец",
    "Часы",
    "Сетка",
    "Южная Гидра",
    "Столовая Гора",
    "Летучая Рыба"
  ],
  "Южная Рыба": [
    "Скульптор",
    "Водолей",
    "Козерог",
    "Микроскоп",
    "Журавль"
  ],
  "Скульптор": [
    "Печь",
    "Кит",
    "Водолей",
    "Южная Рыба",
    "Журавль",
    "Феникс"
  ],
  "Печь": [
    "Эридан",
    "Кит",
    "Скульптор",
    "Феникс"
  ],
  "Феникс": [
    "Эридан",
    "Печь",
    "Скульптор",
    "Журавль",
    "Тукан",
    "Южная Гидра"
  ],
  "Журавль": [
    "Феникс",
    "Скульптор",
    "Южная Рыба",
    "Микроскоп",
    "Индеец",
    "Тукан"
  ],
  "Индеец": [
    "Тукан",
    "Журавль",
    "Микроскоп",
    "Стрелец",
    "Телескоп",
    "Павлин",
    "Октант"
  ],
  "Микроскоп": [
    "Южная Рыба",
    "Козерог",
    "Стрелец",
    "Телескоп",
    "Индеец",
    "Журавль"
  ],
  "Телескоп": [
    "Индеец",
    "Микроскоп",
    "Стрелец",
    "Южная Корона",
    "Жертвенник",
    "Павлин"
  ],
  "Южная Корона": [
    "Стрелец",
    "Скорпион",
    "Жертвенник",
    "Телескоп"
  ],
  "Жертвенник": [
    "Телескоп",
    "Южная Корона",
    "Скорпион",
    "Наугольник",
    "Южный Треугольник",
    "Райская Птица",
    "Павлин"
  ],
  "Наугольник": [
    "Жертвенник",
    "Скорпион",
    "Волк",
    "Циркуль",
    "Южный Треугольник"
  ],
  "Южный Треугольник": [
    "Жертвенник",
    "Наугольник",
    "Циркуль",
    "Райская Птица"
  ],
  "Райская Птица": [
    "Павлин",
    "Жертвенник",
    "Южный Треугольник",
    "Циркуль",
    "Муха",
    "Хамелеон",
    "Октант"
  ],
  "Тукан": [
    "Южная Гидра",
    "Эридан",
    "Феникс",
    "Журавль",
    "Индеец",
    "Октант"
  ],
  "Южная Гидра": [
    "Столовая Гора",
    "Золотая Рыба",
    "Сетка",
    "Часы",
    "Эридан",
    "Феникс",
    "Тукан",
    "Октант"
  ],
  "Столовая Гора": [
    "Хамелеон",
    "Летучая Рыба",
    "Золотая Рыба",
    "Южная Гидра",
    "Октант"
  ],
  "Павлин": [
    "Индеец",
    "Телескоп",
    "Жертвенник",
    "Райская Птица",
    "Октант"
  ],
  "Хамелеон": [
    "Райская Птица",
    "Муха",
    "Киль",
    "Столовая Гора",
    "Летучая Рыба",
    "Октант"
  ],
  "Октант": [
    "Райская Птица",
    "Хамелеон",
    "Столовая Гора",
    "Южная Гидра",
    "Тукан",
    "Индеец",
    "Павлин"
  ]
}

export const allConstellations = Object.keys(constellations)
